ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157dxx_ca7.h
/**************  Bit definition for DDRCTRL_DFILPCFG0 register  ***************/
#define DDRCTRL_DFILPCFG0_DFI_LP_EN_PD_Pos      (0U)
#define DDRCTRL_DFILPCFG0_DFI_LP_EN_PD_Msk      (0x1U << DDRCTRL_DFILPCFG0_DFI_LP_EN_PD_Pos)      /*!< 0x00000001 */
#define DDRCTRL_DFILPCFG0_DFI_LP_EN_PD          DDRCTRL_DFILPCFG0_DFI_LP_EN_PD_Msk                /*!< Enables DFI Low Power interface handshaking during Power Down Entry/Exit. */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_Pos  (4U)
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_Msk  (0xFU << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_Pos)  /*!< 0x000000F0 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD      DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_Msk            /*!< Value in DFI clock cycles to drive on dfi_lp_wakeup signal when Power Down mode is entered. */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_0    (0x1U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_Pos)  /*!< 0x00000010 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_1    (0x2U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_Pos)  /*!< 0x00000020 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_2    (0x4U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_Pos)  /*!< 0x00000040 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_3    (0x8U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_PD_Pos)  /*!< 0x00000080 */
#define DDRCTRL_DFILPCFG0_DFI_LP_EN_SR_Pos      (8U)
#define DDRCTRL_DFILPCFG0_DFI_LP_EN_SR_Msk      (0x1U << DDRCTRL_DFILPCFG0_DFI_LP_EN_SR_Pos)      /*!< 0x00000100 */
#define DDRCTRL_DFILPCFG0_DFI_LP_EN_SR          DDRCTRL_DFILPCFG0_DFI_LP_EN_SR_Msk                /*!< Enables DFI Low Power interface handshaking during Self Refresh Entry/Exit. */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_Pos  (12U)
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_Msk  (0xFU << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_Pos)  /*!< 0x0000F000 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR      DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_Msk            /*!< Value in DFI clpck cycles to drive on dfi_lp_wakeup signal when Self Refresh mode is entered. */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_0    (0x1U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_Pos)  /*!< 0x00001000 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_1    (0x2U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_Pos)  /*!< 0x00002000 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_2    (0x4U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_Pos)  /*!< 0x00004000 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_3    (0x8U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_SR_Pos)  /*!< 0x00008000 */
#define DDRCTRL_DFILPCFG0_DFI_LP_EN_DPD_Pos     (16U)
#define DDRCTRL_DFILPCFG0_DFI_LP_EN_DPD_Msk     (0x1U << DDRCTRL_DFILPCFG0_DFI_LP_EN_DPD_Pos)     /*!< 0x00010000 */
#define DDRCTRL_DFILPCFG0_DFI_LP_EN_DPD         DDRCTRL_DFILPCFG0_DFI_LP_EN_DPD_Msk               /*!< Enables DFI Low-power interface handshaking during Deep Power Down Entry/Exit. */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_Pos (20U)
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_Msk (0xFU << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_Pos) /*!< 0x00F00000 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD     DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_Msk           /*!< Value in DFI clock cycles to drive on dfi_lp_wakeup signal when Deep Power Down mode is entered. */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_0   (0x1U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_Pos) /*!< 0x00100000 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_1   (0x2U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_Pos) /*!< 0x00200000 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_2   (0x4U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_Pos) /*!< 0x00400000 */
#define DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_3   (0x8U << DDRCTRL_DFILPCFG0_DFI_LP_WAKEUP_DPD_Pos) /*!< 0x00800000 */
#define DDRCTRL_DFILPCFG0_DFI_TLP_RESP_Pos      (24U)
#define DDRCTRL_DFILPCFG0_DFI_TLP_RESP_Msk      (0x1FU << DDRCTRL_DFILPCFG0_DFI_TLP_RESP_Pos)     /*!< 0x1F000000 */
#define DDRCTRL_DFILPCFG0_DFI_TLP_RESP          DDRCTRL_DFILPCFG0_DFI_TLP_RESP_Msk                /*!< Setting in DFI clock cycles for DFI\qs tlp_resp time. */
#define DDRCTRL_DFILPCFG0_DFI_TLP_RESP_0        (0x1U << DDRCTRL_DFILPCFG0_DFI_TLP_RESP_Pos)      /*!< 0x01000000 */
#define DDRCTRL_DFILPCFG0_DFI_TLP_RESP_1        (0x2U << DDRCTRL_DFILPCFG0_DFI_TLP_RESP_Pos)      /*!< 0x02000000 */
#define DDRCTRL_DFILPCFG0_DFI_TLP_RESP_2        (0x4U << DDRCTRL_DFILPCFG0_DFI_TLP_RESP_Pos)      /*!< 0x04000000 */
#define DDRCTRL_DFILPCFG0_DFI_TLP_RESP_3        (0x8U << DDRCTRL_DFILPCFG0_DFI_TLP_RESP_Pos)      /*!< 0x08000000 */
#define DDRCTRL_DFILPCFG0_DFI_TLP_RESP_4        (0x10U << DDRCTRL_DFILPCFG0_DFI_TLP_RESP_Pos)     /*!< 0x10000000 */

/***************  Bit definition for DDRCTRL_DFIUPD0 register  ****************/
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos     (0U)
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Msk     (0x3FFU << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)   /*!< 0x000003FF */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN         DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Msk               /*!< Specifies the minimum number of DFI clock cycles that the dfi_ctrlupd_req signal must be asserted. The DDRCTRL expects the PHY to respond within this time. If the PHY does not respond, the DDRCTRL de-asserts dfi_ctrlupd_req after dfi_t_ctrlup_min + 2 cycles. Lowest value to assign to this variable is 0x3. */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_0       (0x1U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)     /*!< 0x00000001 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_1       (0x2U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)     /*!< 0x00000002 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_2       (0x4U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)     /*!< 0x00000004 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_3       (0x8U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)     /*!< 0x00000008 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_4       (0x10U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)    /*!< 0x00000010 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_5       (0x20U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)    /*!< 0x00000020 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_6       (0x40U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)    /*!< 0x00000040 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_7       (0x80U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)    /*!< 0x00000080 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_8       (0x100U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)   /*!< 0x00000100 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_9       (0x200U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MIN_Pos)   /*!< 0x00000200 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos     (16U)
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Msk     (0x3FFU << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)   /*!< 0x03FF0000 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX         DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Msk               /*!< Specifies the maximum number of DFI clock cycles that the dfi_ctrlupd_req signal can assert. Lowest value to assign to this variable is 0x40. */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_0       (0x1U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)     /*!< 0x00010000 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_1       (0x2U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)     /*!< 0x00020000 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_2       (0x4U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)     /*!< 0x00040000 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_3       (0x8U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)     /*!< 0x00080000 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_4       (0x10U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)    /*!< 0x00100000 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_5       (0x20U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)    /*!< 0x00200000 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_6       (0x40U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)    /*!< 0x00400000 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_7       (0x80U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)    /*!< 0x00800000 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_8       (0x100U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)   /*!< 0x01000000 */
#define DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_9       (0x200U << DDRCTRL_DFIUPD0_DFI_T_CTRLUP_MAX_Pos)   /*!< 0x02000000 */
#define DDRCTRL_DFIUPD0_CTRLUPD_PRE_SRX_Pos      (29U)
#define DDRCTRL_DFIUPD0_CTRLUPD_PRE_SRX_Msk      (0x1U << DDRCTRL_DFIUPD0_CTRLUPD_PRE_SRX_Pos)      /*!< 0x20000000 */
#define DDRCTRL_DFIUPD0_CTRLUPD_PRE_SRX          DDRCTRL_DFIUPD0_CTRLUPD_PRE_SRX_Msk                /*!< Selects dfi_ctrlupd_req requirements at SRX: */
#define DDRCTRL_DFIUPD0_DIS_AUTO_CTRLUPD_SRX_Pos (30U)
#define DDRCTRL_DFIUPD0_DIS_AUTO_CTRLUPD_SRX_Msk (0x1U << DDRCTRL_DFIUPD0_DIS_AUTO_CTRLUPD_SRX_Pos) /*!< 0x40000000 */
#define DDRCTRL_DFIUPD0_DIS_AUTO_CTRLUPD_SRX     DDRCTRL_DFIUPD0_DIS_AUTO_CTRLUPD_SRX_Msk           /*!< When \q1\q, disable the automatic dfi_ctrlupd_req generation by the DDRCTRL at self-refresh exit. */
#define DDRCTRL_DFIUPD0_DIS_AUTO_CTRLUPD_Pos     (31U)
#define DDRCTRL_DFIUPD0_DIS_AUTO_CTRLUPD_Msk     (0x1U << DDRCTRL_DFIUPD0_DIS_AUTO_CTRLUPD_Pos)     /*!< 0x80000000 */
#define DDRCTRL_DFIUPD0_DIS_AUTO_CTRLUPD         DDRCTRL_DFIUPD0_DIS_AUTO_CTRLUPD_Msk               /*!< When \q1\q, disable the automatic dfi_ctrlupd_req generation by the DDRCTRL. The core must issue the dfi_ctrlupd_req signal using register DBGCMD.ctrlupd. */

/***************  Bit definition for DDRCTRL_DFIUPD1 register  ****************/
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Pos (0U)
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Msk (0xFFU << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Pos) /*!< 0x000000FF */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024     DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Msk            /*!< This is the maximum amount of time between DDRCTRL initiated DFI update requests. This timer resets with each update request; when the timer expires dfi_ctrlupd_req is sent and traffic is blocked until the dfi_ctrlupd_ackx is received. PHY can use this idle time to recalibrate the delay lines to the DLLs. The DFI controller update is also used to reset PHY FIFO pointers in case of data capture errors. Updates are required to maintain calibration over PVT, but frequent updates may impact performance. Minimum allowed value for this field is 1. */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_0   (0x1U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Pos)  /*!< 0x00000001 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_1   (0x2U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Pos)  /*!< 0x00000002 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_2   (0x4U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Pos)  /*!< 0x00000004 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_3   (0x8U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Pos)  /*!< 0x00000008 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_4   (0x10U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Pos) /*!< 0x00000010 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_5   (0x20U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Pos) /*!< 0x00000020 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_6   (0x40U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Pos) /*!< 0x00000040 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_7   (0x80U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MAX_X1024_Pos) /*!< 0x00000080 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Pos (16U)
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Msk (0xFFU << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Pos) /*!< 0x00FF0000 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024     DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Msk            /*!< This is the minimum amount of time between DDRCTRL initiated DFI update requests (which is executed whenever the DDRCTRL is idle). Set this number higher to reduce the frequency of update requests, which can have a small impact on the latency of the first read request when the DDRCTRL is idle. Minimum allowed value for this field is 1. */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_0   (0x1U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Pos)  /*!< 0x00010000 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_1   (0x2U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Pos)  /*!< 0x00020000 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_2   (0x4U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Pos)  /*!< 0x00040000 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_3   (0x8U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Pos)  /*!< 0x00080000 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_4   (0x10U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Pos) /*!< 0x00100000 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_5   (0x20U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Pos) /*!< 0x00200000 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_6   (0x40U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Pos) /*!< 0x00400000 */
#define DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_7   (0x80U << DDRCTRL_DFIUPD1_DFI_T_CTRLUPD_INTERVAL_MIN_X1024_Pos) /*!< 0x00800000 */

/***************  Bit definition for DDRCTRL_DFIUPD2 register  ****************/
#define DDRCTRL_DFIUPD2_DFI_PHYUPD_EN_Pos (31U)
#define DDRCTRL_DFIUPD2_DFI_PHYUPD_EN_Msk (0x1U << DDRCTRL_DFIUPD2_DFI_PHYUPD_EN_Pos) /*!< 0x80000000 */
#define DDRCTRL_DFIUPD2_DFI_PHYUPD_EN     DDRCTRL_DFIUPD2_DFI_PHYUPD_EN_Msk           /*!< Enables the support for acknowledging PHY-initiated updates: */

