ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157dxx_ca7.h
/*************  Bit definition for RCC_MP_TZAHB6ENSETR register  **************/
#define RCC_MP_TZAHB6ENSETR_MDMAEN_Pos            (0U)
#define RCC_MP_TZAHB6ENSETR_MDMAEN_Msk            (0x1U << RCC_MP_TZAHB6ENSETR_MDMAEN_Pos)           /*!< 0x00000001 */
#define RCC_MP_TZAHB6ENSETR_MDMAEN                RCC_MP_TZAHB6ENSETR_MDMAEN_Msk                     /*!< MDMA peripheral clocks enable */

/*************  Bit definition for RCC_MP_TZAHB6ENCLRR register  **************/
#define RCC_MP_TZAHB6ENCLRR_MDMAEN_Pos            (0U)
#define RCC_MP_TZAHB6ENCLRR_MDMAEN_Msk            (0x1U << RCC_MP_TZAHB6ENCLRR_MDMAEN_Pos)           /*!< 0x00000001 */
#define RCC_MP_TZAHB6ENCLRR_MDMAEN                RCC_MP_TZAHB6ENCLRR_MDMAEN_Msk                     /*!< MDMA peripheral clocks enable */

/**************  Bit definition for RCC_MC_APB4ENSETR register  ***************/
#define RCC_MC_APB4ENSETR_LTDCEN_Pos              (0U)
#define RCC_MC_APB4ENSETR_LTDCEN_Msk              (0x1U << RCC_MC_APB4ENSETR_LTDCEN_Pos)             /*!< 0x00000001 */
#define RCC_MC_APB4ENSETR_LTDCEN                  RCC_MC_APB4ENSETR_LTDCEN_Msk                       /*!< LTDC peripheral clocks enable */
#define RCC_MC_APB4ENSETR_DSIEN_Pos               (4U)
#define RCC_MC_APB4ENSETR_DSIEN_Msk               (0x1U << RCC_MC_APB4ENSETR_DSIEN_Pos)              /*!< 0x00000010 */
#define RCC_MC_APB4ENSETR_DSIEN                   RCC_MC_APB4ENSETR_DSIEN_Msk                        /*!< DSI peripheral clocks enable */
#define RCC_MC_APB4ENSETR_DDRPERFMEN_Pos          (8U)
#define RCC_MC_APB4ENSETR_DDRPERFMEN_Msk          (0x1U << RCC_MC_APB4ENSETR_DDRPERFMEN_Pos)         /*!< 0x00000100 */
#define RCC_MC_APB4ENSETR_DDRPERFMEN              RCC_MC_APB4ENSETR_DDRPERFMEN_Msk                   /*!< DDRPERFM APB clock enable */
#define RCC_MC_APB4ENSETR_USBPHYEN_Pos            (16U)
#define RCC_MC_APB4ENSETR_USBPHYEN_Msk            (0x1U << RCC_MC_APB4ENSETR_USBPHYEN_Pos)           /*!< 0x00010000 */
#define RCC_MC_APB4ENSETR_USBPHYEN                RCC_MC_APB4ENSETR_USBPHYEN_Msk                     /*!< USBPHYC peripheral clocks enable */
#define RCC_MC_APB4ENSETR_STGENROEN_Pos           (20U)
#define RCC_MC_APB4ENSETR_STGENROEN_Msk           (0x1U << RCC_MC_APB4ENSETR_STGENROEN_Pos)          /*!< 0x00100000 */
#define RCC_MC_APB4ENSETR_STGENROEN               RCC_MC_APB4ENSETR_STGENROEN_Msk                    /*!< STGEN Read-Only interface peripheral clocks enable */

/**************  Bit definition for RCC_MC_APB4ENCLRR register  ***************/
#define RCC_MC_APB4ENCLRR_LTDCEN_Pos              (0U)
#define RCC_MC_APB4ENCLRR_LTDCEN_Msk              (0x1U << RCC_MC_APB4ENCLRR_LTDCEN_Pos)             /*!< 0x00000001 */
#define RCC_MC_APB4ENCLRR_LTDCEN                  RCC_MC_APB4ENCLRR_LTDCEN_Msk                       /*!< LTDC peripheral clocks disable */
#define RCC_MC_APB4ENCLRR_DSIEN_Pos               (4U)
#define RCC_MC_APB4ENCLRR_DSIEN_Msk               (0x1U << RCC_MC_APB4ENCLRR_DSIEN_Pos)              /*!< 0x00000010 */
#define RCC_MC_APB4ENCLRR_DSIEN                   RCC_MC_APB4ENCLRR_DSIEN_Msk                        /*!< DSI peripheral clocks disable */
#define RCC_MC_APB4ENCLRR_DDRPERFMEN_Pos          (8U)
#define RCC_MC_APB4ENCLRR_DDRPERFMEN_Msk          (0x1U << RCC_MC_APB4ENCLRR_DDRPERFMEN_Pos)         /*!< 0x00000100 */
#define RCC_MC_APB4ENCLRR_DDRPERFMEN              RCC_MC_APB4ENCLRR_DDRPERFMEN_Msk                   /*!< DDRPERFM APB clock enable */
#define RCC_MC_APB4ENCLRR_USBPHYEN_Pos            (16U)
#define RCC_MC_APB4ENCLRR_USBPHYEN_Msk            (0x1U << RCC_MC_APB4ENCLRR_USBPHYEN_Pos)           /*!< 0x00010000 */
#define RCC_MC_APB4ENCLRR_USBPHYEN                RCC_MC_APB4ENCLRR_USBPHYEN_Msk                     /*!< USBPHYC peripheral clocks disable */
#define RCC_MC_APB4ENCLRR_STGENROEN_Pos           (20U)
#define RCC_MC_APB4ENCLRR_STGENROEN_Msk           (0x1U << RCC_MC_APB4ENCLRR_STGENROEN_Pos)          /*!< 0x00100000 */
#define RCC_MC_APB4ENCLRR_STGENROEN               RCC_MC_APB4ENCLRR_STGENROEN_Msk                    /*!< STGEN Read-Only interface peripheral clocks disable */

/**************  Bit definition for RCC_MC_APB5ENSETR register  ***************/
#define RCC_MC_APB5ENSETR_SPI6EN_Pos              (0U)
#define RCC_MC_APB5ENSETR_SPI6EN_Msk              (0x1U << RCC_MC_APB5ENSETR_SPI6EN_Pos)             /*!< 0x00000001 */
#define RCC_MC_APB5ENSETR_SPI6EN                  RCC_MC_APB5ENSETR_SPI6EN_Msk                       /*!< SPI6 peripheral clocks enable */
#define RCC_MC_APB5ENSETR_I2C4EN_Pos              (2U)
#define RCC_MC_APB5ENSETR_I2C4EN_Msk              (0x1U << RCC_MC_APB5ENSETR_I2C4EN_Pos)             /*!< 0x00000004 */
#define RCC_MC_APB5ENSETR_I2C4EN                  RCC_MC_APB5ENSETR_I2C4EN_Msk                       /*!< I2C4 peripheral clocks enable */
#define RCC_MC_APB5ENSETR_I2C6EN_Pos              (3U)
#define RCC_MC_APB5ENSETR_I2C6EN_Msk              (0x1U << RCC_MC_APB5ENSETR_I2C6EN_Pos)             /*!< 0x00000008 */
#define RCC_MC_APB5ENSETR_I2C6EN                  RCC_MC_APB5ENSETR_I2C6EN_Msk                       /*!< I2C6 peripheral clocks enable */
#define RCC_MC_APB5ENSETR_USART1EN_Pos            (4U)
#define RCC_MC_APB5ENSETR_USART1EN_Msk            (0x1U << RCC_MC_APB5ENSETR_USART1EN_Pos)           /*!< 0x00000010 */
#define RCC_MC_APB5ENSETR_USART1EN                RCC_MC_APB5ENSETR_USART1EN_Msk                     /*!< USART1 peripheral clocks enable */
#define RCC_MC_APB5ENSETR_RTCAPBEN_Pos            (8U)
#define RCC_MC_APB5ENSETR_RTCAPBEN_Msk            (0x1U << RCC_MC_APB5ENSETR_RTCAPBEN_Pos)           /*!< 0x00000100 */
#define RCC_MC_APB5ENSETR_RTCAPBEN                RCC_MC_APB5ENSETR_RTCAPBEN_Msk                     /*!< RTC APB clock enable */
#define RCC_MC_APB5ENSETR_TZC1EN_Pos              (11U)
#define RCC_MC_APB5ENSETR_TZC1EN_Msk              (0x1U << RCC_MC_APB5ENSETR_TZC1EN_Pos)             /*!< 0x00000800 */
#define RCC_MC_APB5ENSETR_TZC1EN                  RCC_MC_APB5ENSETR_TZC1EN_Msk                       /*!< TZC AXI port 1 clocks enable */
#define RCC_MC_APB5ENSETR_TZC2EN_Pos              (12U)
#define RCC_MC_APB5ENSETR_TZC2EN_Msk              (0x1U << RCC_MC_APB5ENSETR_TZC2EN_Pos)             /*!< 0x00001000 */
#define RCC_MC_APB5ENSETR_TZC2EN                  RCC_MC_APB5ENSETR_TZC2EN_Msk                       /*!< TZC AXI port 2 clocks enable */
#define RCC_MC_APB5ENSETR_TZPCEN_Pos              (13U)
#define RCC_MC_APB5ENSETR_TZPCEN_Msk              (0x1U << RCC_MC_APB5ENSETR_TZPCEN_Pos)             /*!< 0x00002000 */
#define RCC_MC_APB5ENSETR_TZPCEN                  RCC_MC_APB5ENSETR_TZPCEN_Msk                       /*!< TZPC peripheral clocks enable */
#define RCC_MC_APB5ENSETR_BSECEN_Pos              (16U)
#define RCC_MC_APB5ENSETR_BSECEN_Msk              (0x1U << RCC_MC_APB5ENSETR_BSECEN_Pos)             /*!< 0x00010000 */
#define RCC_MC_APB5ENSETR_BSECEN                  RCC_MC_APB5ENSETR_BSECEN_Msk                       /*!< BSEC peripheral clocks enable */
#define RCC_MC_APB5ENSETR_STGENEN_Pos             (20U)
#define RCC_MC_APB5ENSETR_STGENEN_Msk             (0x1U << RCC_MC_APB5ENSETR_STGENEN_Pos)            /*!< 0x00100000 */
#define RCC_MC_APB5ENSETR_STGENEN                 RCC_MC_APB5ENSETR_STGENEN_Msk                      /*!< STGEN Controller part, peripheral clocks enable */

/**************  Bit definition for RCC_MC_APB5ENCLRR register  ***************/
#define RCC_MC_APB5ENCLRR_SPI6EN_Pos              (0U)
#define RCC_MC_APB5ENCLRR_SPI6EN_Msk              (0x1U << RCC_MC_APB5ENCLRR_SPI6EN_Pos)             /*!< 0x00000001 */
#define RCC_MC_APB5ENCLRR_SPI6EN                  RCC_MC_APB5ENCLRR_SPI6EN_Msk                       /*!< SPI6 peripheral clocks disable */
#define RCC_MC_APB5ENCLRR_I2C4EN_Pos              (2U)
#define RCC_MC_APB5ENCLRR_I2C4EN_Msk              (0x1U << RCC_MC_APB5ENCLRR_I2C4EN_Pos)             /*!< 0x00000004 */
#define RCC_MC_APB5ENCLRR_I2C4EN                  RCC_MC_APB5ENCLRR_I2C4EN_Msk                       /*!< I2C4 peripheral clocks disable */
#define RCC_MC_APB5ENCLRR_I2C6EN_Pos              (3U)
#define RCC_MC_APB5ENCLRR_I2C6EN_Msk              (0x1U << RCC_MC_APB5ENCLRR_I2C6EN_Pos)             /*!< 0x00000008 */
#define RCC_MC_APB5ENCLRR_I2C6EN                  RCC_MC_APB5ENCLRR_I2C6EN_Msk                       /*!< I2C6 peripheral clocks disable */
#define RCC_MC_APB5ENCLRR_USART1EN_Pos            (4U)
#define RCC_MC_APB5ENCLRR_USART1EN_Msk            (0x1U << RCC_MC_APB5ENCLRR_USART1EN_Pos)           /*!< 0x00000010 */
#define RCC_MC_APB5ENCLRR_USART1EN                RCC_MC_APB5ENCLRR_USART1EN_Msk                     /*!< USART1 peripheral clocks disable */
#define RCC_MC_APB5ENCLRR_RTCAPBEN_Pos            (8U)
#define RCC_MC_APB5ENCLRR_RTCAPBEN_Msk            (0x1U << RCC_MC_APB5ENCLRR_RTCAPBEN_Pos)           /*!< 0x00000100 */
#define RCC_MC_APB5ENCLRR_RTCAPBEN                RCC_MC_APB5ENCLRR_RTCAPBEN_Msk                     /*!< RTC APB clock disable */
#define RCC_MC_APB5ENCLRR_TZC1EN_Pos              (11U)
#define RCC_MC_APB5ENCLRR_TZC1EN_Msk              (0x1U << RCC_MC_APB5ENCLRR_TZC1EN_Pos)             /*!< 0x00000800 */
#define RCC_MC_APB5ENCLRR_TZC1EN                  RCC_MC_APB5ENCLRR_TZC1EN_Msk                       /*!< TZC AXI port 1 clocks disable */
#define RCC_MC_APB5ENCLRR_TZC2EN_Pos              (12U)
#define RCC_MC_APB5ENCLRR_TZC2EN_Msk              (0x1U << RCC_MC_APB5ENCLRR_TZC2EN_Pos)             /*!< 0x00001000 */
#define RCC_MC_APB5ENCLRR_TZC2EN                  RCC_MC_APB5ENCLRR_TZC2EN_Msk                       /*!< TZC AXI port 2 clocks disable */
#define RCC_MC_APB5ENCLRR_TZPCEN_Pos              (13U)
#define RCC_MC_APB5ENCLRR_TZPCEN_Msk              (0x1U << RCC_MC_APB5ENCLRR_TZPCEN_Pos)             /*!< 0x00002000 */
#define RCC_MC_APB5ENCLRR_TZPCEN                  RCC_MC_APB5ENCLRR_TZPCEN_Msk                       /*!< TZPC peripheral clocks disable */
#define RCC_MC_APB5ENCLRR_BSECEN_Pos              (16U)
#define RCC_MC_APB5ENCLRR_BSECEN_Msk              (0x1U << RCC_MC_APB5ENCLRR_BSECEN_Pos)             /*!< 0x00010000 */
#define RCC_MC_APB5ENCLRR_BSECEN                  RCC_MC_APB5ENCLRR_BSECEN_Msk                       /*!< BSEC peripheral clocks disable */
#define RCC_MC_APB5ENCLRR_STGENEN_Pos             (20U)
#define RCC_MC_APB5ENCLRR_STGENEN_Msk             (0x1U << RCC_MC_APB5ENCLRR_STGENEN_Pos)            /*!< 0x00100000 */
#define RCC_MC_APB5ENCLRR_STGENEN                 RCC_MC_APB5ENCLRR_STGENEN_Msk                      /*!< STGEN Controller part, peripheral clocks disable */

/**************  Bit definition for RCC_MC_AHB5ENSETR register  ***************/
#define RCC_MC_AHB5ENSETR_GPIOZEN_Pos             (0U)
#define RCC_MC_AHB5ENSETR_GPIOZEN_Msk             (0x1U << RCC_MC_AHB5ENSETR_GPIOZEN_Pos)            /*!< 0x00000001 */
#define RCC_MC_AHB5ENSETR_GPIOZEN                 RCC_MC_AHB5ENSETR_GPIOZEN_Msk                      /*!< GPIOZ Secure peripheral clocks enable */
#define RCC_MC_AHB5ENSETR_CRYP1EN_Pos             (4U)
#define RCC_MC_AHB5ENSETR_CRYP1EN_Msk             (0x1U << RCC_MC_AHB5ENSETR_CRYP1EN_Pos)            /*!< 0x00000010 */
#define RCC_MC_AHB5ENSETR_CRYP1EN                 RCC_MC_AHB5ENSETR_CRYP1EN_Msk                      /*!< CRYP1 (3DES/AES1) peripheral clocks enable */
#define RCC_MC_AHB5ENSETR_HASH1EN_Pos             (5U)
#define RCC_MC_AHB5ENSETR_HASH1EN_Msk             (0x1U << RCC_MC_AHB5ENSETR_HASH1EN_Pos)            /*!< 0x00000020 */
#define RCC_MC_AHB5ENSETR_HASH1EN                 RCC_MC_AHB5ENSETR_HASH1EN_Msk                      /*!< HASH1 peripheral clocks enable */
#define RCC_MC_AHB5ENSETR_RNG1EN_Pos              (6U)
#define RCC_MC_AHB5ENSETR_RNG1EN_Msk              (0x1U << RCC_MC_AHB5ENSETR_RNG1EN_Pos)             /*!< 0x00000040 */
#define RCC_MC_AHB5ENSETR_RNG1EN                  RCC_MC_AHB5ENSETR_RNG1EN_Msk                       /*!< RNG1 peripheral clocks enable */
#define RCC_MC_AHB5ENSETR_BKPSRAMEN_Pos           (8U)
#define RCC_MC_AHB5ENSETR_BKPSRAMEN_Msk           (0x1U << RCC_MC_AHB5ENSETR_BKPSRAMEN_Pos)          /*!< 0x00000100 */
#define RCC_MC_AHB5ENSETR_BKPSRAMEN               RCC_MC_AHB5ENSETR_BKPSRAMEN_Msk                    /*!< BKPSRAM clocks enable */

/**************  Bit definition for RCC_MC_AHB5ENCLRR register  ***************/
#define RCC_MC_AHB5ENCLRR_GPIOZEN_Pos             (0U)
#define RCC_MC_AHB5ENCLRR_GPIOZEN_Msk             (0x1U << RCC_MC_AHB5ENCLRR_GPIOZEN_Pos)            /*!< 0x00000001 */
#define RCC_MC_AHB5ENCLRR_GPIOZEN                 RCC_MC_AHB5ENCLRR_GPIOZEN_Msk                      /*!< GPIOZ Secure peripheral clocks enable */
#define RCC_MC_AHB5ENCLRR_CRYP1EN_Pos             (4U)
#define RCC_MC_AHB5ENCLRR_CRYP1EN_Msk             (0x1U << RCC_MC_AHB5ENCLRR_CRYP1EN_Pos)            /*!< 0x00000010 */
#define RCC_MC_AHB5ENCLRR_CRYP1EN                 RCC_MC_AHB5ENCLRR_CRYP1EN_Msk                      /*!< CRYP1 (3DES/AES1) peripheral clocks enable */
#define RCC_MC_AHB5ENCLRR_HASH1EN_Pos             (5U)
#define RCC_MC_AHB5ENCLRR_HASH1EN_Msk             (0x1U << RCC_MC_AHB5ENCLRR_HASH1EN_Pos)            /*!< 0x00000020 */
#define RCC_MC_AHB5ENCLRR_HASH1EN                 RCC_MC_AHB5ENCLRR_HASH1EN_Msk                      /*!< HASH1 peripheral clocks enable */
#define RCC_MC_AHB5ENCLRR_RNG1EN_Pos              (6U)
#define RCC_MC_AHB5ENCLRR_RNG1EN_Msk              (0x1U << RCC_MC_AHB5ENCLRR_RNG1EN_Pos)             /*!< 0x00000040 */
#define RCC_MC_AHB5ENCLRR_RNG1EN                  RCC_MC_AHB5ENCLRR_RNG1EN_Msk                       /*!< RNG1 peripheral clocks enable */
#define RCC_MC_AHB5ENCLRR_BKPSRAMEN_Pos           (8U)
#define RCC_MC_AHB5ENCLRR_BKPSRAMEN_Msk           (0x1U << RCC_MC_AHB5ENCLRR_BKPSRAMEN_Pos)          /*!< 0x00000100 */
#define RCC_MC_AHB5ENCLRR_BKPSRAMEN               RCC_MC_AHB5ENCLRR_BKPSRAMEN_Msk                    /*!< BKPSRAM clocks enable */

/**************  Bit definition for RCC_MC_AHB6ENSETR register  ***************/
#define RCC_MC_AHB6ENSETR_MDMAEN_Pos              (0U)
#define RCC_MC_AHB6ENSETR_MDMAEN_Msk              (0x1U << RCC_MC_AHB6ENSETR_MDMAEN_Pos)             /*!< 0x00000001 */
#define RCC_MC_AHB6ENSETR_MDMAEN                  RCC_MC_AHB6ENSETR_MDMAEN_Msk                       /*!< MDMA peripheral clocks enable */
#define RCC_MC_AHB6ENSETR_GPUEN_Pos               (5U)
#define RCC_MC_AHB6ENSETR_GPUEN_Msk               (0x1U << RCC_MC_AHB6ENSETR_GPUEN_Pos)              /*!< 0x00000020 */
#define RCC_MC_AHB6ENSETR_GPUEN                   RCC_MC_AHB6ENSETR_GPUEN_Msk                        /*!< GPU peripheral clocks enable */
#define RCC_MC_AHB6ENSETR_ETHCKEN_Pos             (7U)
#define RCC_MC_AHB6ENSETR_ETHCKEN_Msk             (0x1U << RCC_MC_AHB6ENSETR_ETHCKEN_Pos)            /*!< 0x00000080 */
#define RCC_MC_AHB6ENSETR_ETHCKEN                 RCC_MC_AHB6ENSETR_ETHCKEN_Msk                      /*!< Enable of the Ethernet clock generated by the RCC (eth_ker_ck) */
#define RCC_MC_AHB6ENSETR_ETHTXEN_Pos             (8U)
#define RCC_MC_AHB6ENSETR_ETHTXEN_Msk             (0x1U << RCC_MC_AHB6ENSETR_ETHTXEN_Pos)            /*!< 0x00000100 */
#define RCC_MC_AHB6ENSETR_ETHTXEN                 RCC_MC_AHB6ENSETR_ETHTXEN_Msk                      /*!< Ethernet Transmission Clock Enable */
#define RCC_MC_AHB6ENSETR_ETHRXEN_Pos             (9U)
#define RCC_MC_AHB6ENSETR_ETHRXEN_Msk             (0x1U << RCC_MC_AHB6ENSETR_ETHRXEN_Pos)            /*!< 0x00000200 */
#define RCC_MC_AHB6ENSETR_ETHRXEN                 RCC_MC_AHB6ENSETR_ETHRXEN_Msk                      /*!< Ethernet Reception Clock Enable */
#define RCC_MC_AHB6ENSETR_ETHMACEN_Pos            (10U)
#define RCC_MC_AHB6ENSETR_ETHMACEN_Msk            (0x1U << RCC_MC_AHB6ENSETR_ETHMACEN_Pos)           /*!< 0x00000400 */
#define RCC_MC_AHB6ENSETR_ETHMACEN                RCC_MC_AHB6ENSETR_ETHMACEN_Msk                     /*!< Ethernet MAC bus interface Clock Enable (hclk6 and aclk) */
#define RCC_MC_AHB6ENSETR_FMCEN_Pos               (12U)
#define RCC_MC_AHB6ENSETR_FMCEN_Msk               (0x1U << RCC_MC_AHB6ENSETR_FMCEN_Pos)              /*!< 0x00001000 */
#define RCC_MC_AHB6ENSETR_FMCEN                   RCC_MC_AHB6ENSETR_FMCEN_Msk                        /*!< FMC peripheral clocks enable */
#define RCC_MC_AHB6ENSETR_QSPIEN_Pos              (14U)
#define RCC_MC_AHB6ENSETR_QSPIEN_Msk              (0x1U << RCC_MC_AHB6ENSETR_QSPIEN_Pos)             /*!< 0x00004000 */
#define RCC_MC_AHB6ENSETR_QSPIEN                  RCC_MC_AHB6ENSETR_QSPIEN_Msk                       /*!< QUADSPI peripheral clocks enable */
#define RCC_MC_AHB6ENSETR_SDMMC1EN_Pos            (16U)
#define RCC_MC_AHB6ENSETR_SDMMC1EN_Msk            (0x1U << RCC_MC_AHB6ENSETR_SDMMC1EN_Pos)           /*!< 0x00010000 */
#define RCC_MC_AHB6ENSETR_SDMMC1EN                RCC_MC_AHB6ENSETR_SDMMC1EN_Msk                     /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable */
#define RCC_MC_AHB6ENSETR_SDMMC2EN_Pos            (17U)
#define RCC_MC_AHB6ENSETR_SDMMC2EN_Msk            (0x1U << RCC_MC_AHB6ENSETR_SDMMC2EN_Pos)           /*!< 0x00020000 */
#define RCC_MC_AHB6ENSETR_SDMMC2EN                RCC_MC_AHB6ENSETR_SDMMC2EN_Msk                     /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable */
#define RCC_MC_AHB6ENSETR_CRC1EN_Pos              (20U)
#define RCC_MC_AHB6ENSETR_CRC1EN_Msk              (0x1U << RCC_MC_AHB6ENSETR_CRC1EN_Pos)             /*!< 0x00100000 */
#define RCC_MC_AHB6ENSETR_CRC1EN                  RCC_MC_AHB6ENSETR_CRC1EN_Msk                       /*!< CRC1 peripheral clocks enable */
#define RCC_MC_AHB6ENSETR_USBHEN_Pos              (24U)
#define RCC_MC_AHB6ENSETR_USBHEN_Msk              (0x1U << RCC_MC_AHB6ENSETR_USBHEN_Pos)             /*!< 0x01000000 */
#define RCC_MC_AHB6ENSETR_USBHEN                  RCC_MC_AHB6ENSETR_USBHEN_Msk                       /*!< USBH peripheral clocks enable */

/**************  Bit definition for RCC_MC_AHB6ENCLRR register  ***************/
#define RCC_MC_AHB6ENCLRR_MDMAEN_Pos              (0U)
#define RCC_MC_AHB6ENCLRR_MDMAEN_Msk              (0x1U << RCC_MC_AHB6ENCLRR_MDMAEN_Pos)             /*!< 0x00000001 */
#define RCC_MC_AHB6ENCLRR_MDMAEN                  RCC_MC_AHB6ENCLRR_MDMAEN_Msk                       /*!< MDMA peripheral clocks enable */
#define RCC_MC_AHB6ENCLRR_GPUEN_Pos               (5U)
#define RCC_MC_AHB6ENCLRR_GPUEN_Msk               (0x1U << RCC_MC_AHB6ENCLRR_GPUEN_Pos)              /*!< 0x00000020 */
#define RCC_MC_AHB6ENCLRR_GPUEN                   RCC_MC_AHB6ENCLRR_GPUEN_Msk                        /*!< GPU peripheral clocks enable */
#define RCC_MC_AHB6ENCLRR_ETHCKEN_Pos             (7U)
#define RCC_MC_AHB6ENCLRR_ETHCKEN_Msk             (0x1U << RCC_MC_AHB6ENCLRR_ETHCKEN_Pos)            /*!< 0x00000080 */
#define RCC_MC_AHB6ENCLRR_ETHCKEN                 RCC_MC_AHB6ENCLRR_ETHCKEN_Msk                      /*!< Disable of the Ethernet clock generated by the RCC (eth_ker_ck) */
#define RCC_MC_AHB6ENCLRR_ETHTXEN_Pos             (8U)
#define RCC_MC_AHB6ENCLRR_ETHTXEN_Msk             (0x1U << RCC_MC_AHB6ENCLRR_ETHTXEN_Pos)            /*!< 0x00000100 */
#define RCC_MC_AHB6ENCLRR_ETHTXEN                 RCC_MC_AHB6ENCLRR_ETHTXEN_Msk                      /*!< Disable of the Ethernet Transmission Clock */
#define RCC_MC_AHB6ENCLRR_ETHRXEN_Pos             (9U)
#define RCC_MC_AHB6ENCLRR_ETHRXEN_Msk             (0x1U << RCC_MC_AHB6ENCLRR_ETHRXEN_Pos)            /*!< 0x00000200 */
#define RCC_MC_AHB6ENCLRR_ETHRXEN                 RCC_MC_AHB6ENCLRR_ETHRXEN_Msk                      /*!< Disable of the Ethernet Reception Clock */
#define RCC_MC_AHB6ENCLRR_ETHMACEN_Pos            (10U)
#define RCC_MC_AHB6ENCLRR_ETHMACEN_Msk            (0x1U << RCC_MC_AHB6ENCLRR_ETHMACEN_Pos)           /*!< 0x00000400 */
#define RCC_MC_AHB6ENCLRR_ETHMACEN                RCC_MC_AHB6ENCLRR_ETHMACEN_Msk                     /*!< Disable of the bus interface clock for ETH block (hclk6 and aclk) */
#define RCC_MC_AHB6ENCLRR_FMCEN_Pos               (12U)
#define RCC_MC_AHB6ENCLRR_FMCEN_Msk               (0x1U << RCC_MC_AHB6ENCLRR_FMCEN_Pos)              /*!< 0x00001000 */
#define RCC_MC_AHB6ENCLRR_FMCEN                   RCC_MC_AHB6ENCLRR_FMCEN_Msk                        /*!< FMC peripheral clocks enable */
#define RCC_MC_AHB6ENCLRR_QSPIEN_Pos              (14U)
#define RCC_MC_AHB6ENCLRR_QSPIEN_Msk              (0x1U << RCC_MC_AHB6ENCLRR_QSPIEN_Pos)             /*!< 0x00004000 */
#define RCC_MC_AHB6ENCLRR_QSPIEN                  RCC_MC_AHB6ENCLRR_QSPIEN_Msk                       /*!< QUADSPI and QUADSPI delay block peripheral clocks enable */
#define RCC_MC_AHB6ENCLRR_SDMMC1EN_Pos            (16U)
#define RCC_MC_AHB6ENCLRR_SDMMC1EN_Msk            (0x1U << RCC_MC_AHB6ENCLRR_SDMMC1EN_Pos)           /*!< 0x00010000 */
#define RCC_MC_AHB6ENCLRR_SDMMC1EN                RCC_MC_AHB6ENCLRR_SDMMC1EN_Msk                     /*!< SDMMC1 and SDMMC1 delay (DLYBSD1) block peripheral clocks enable */
#define RCC_MC_AHB6ENCLRR_SDMMC2EN_Pos            (17U)
#define RCC_MC_AHB6ENCLRR_SDMMC2EN_Msk            (0x1U << RCC_MC_AHB6ENCLRR_SDMMC2EN_Pos)           /*!< 0x00020000 */
#define RCC_MC_AHB6ENCLRR_SDMMC2EN                RCC_MC_AHB6ENCLRR_SDMMC2EN_Msk                     /*!< SDMMC2 and SDMMC2 delay (DLYBSD2) block peripheral clocks enable */
#define RCC_MC_AHB6ENCLRR_CRC1EN_Pos              (20U)
#define RCC_MC_AHB6ENCLRR_CRC1EN_Msk              (0x1U << RCC_MC_AHB6ENCLRR_CRC1EN_Pos)             /*!< 0x00100000 */
#define RCC_MC_AHB6ENCLRR_CRC1EN                  RCC_MC_AHB6ENCLRR_CRC1EN_Msk                       /*!< CRC1 peripheral clocks enable */
#define RCC_MC_AHB6ENCLRR_USBHEN_Pos              (24U)
#define RCC_MC_AHB6ENCLRR_USBHEN_Msk              (0x1U << RCC_MC_AHB6ENCLRR_USBHEN_Pos)             /*!< 0x01000000 */
#define RCC_MC_AHB6ENCLRR_USBHEN                  RCC_MC_AHB6ENCLRR_USBHEN_Msk                       /*!< USBH peripheral clocks enable */

